<?
$quizData = [
1 => 
"Чи кривдник колись погрожував застосувати та/або застосовував зброю або інші предмети, які можуть спричинити шкоду життю та здоров'ю вам та/або вашим дітям? Чи кривдник колись погрожував застосувати та/або застосовував зброю або інші предмети, які можуть спричинити шкоду життю та здоров'ю вам та/або вашим дітям?",
2 => 
"Чи кривдник погрожував вбити вас та/або ваших дітей?",
3 =>
"Чи допускаєте ви, що кривдник може спробувати вбити вас та/або ваших дітей?",
4 =>
"Чи кривдник коли-небудь душив вас, або передавлював вам горло, або намагався це зробити?",
5 =>
"Чи кривдник застосовував раніше фізичне насильство, яке мало наслідки спричинення середнього та/або тяжкого ступеня тілесних ушкоджень?",
6 =>
"Чи застосовувався протягом останнього року до кривдника терміновий заборонний припис?",
7 =>
"Чи кривдник має зброю та/або може її легко дістати і застосувати?",
8 =>
"Чи кривдник схильний до сильних та/або постійних ревнощів та чи контролює більшу частину вашого повсякденного життя?",
9 =>
"Чи висловлював кривдник наміри та/або намагався вчинити самогубство?",
10 =>
"Чи кривдник залякував, переслідував або погрожував вам та/або вашим дітям?",
11 =>
"Чи здійснював кривдник напади на вас та/або ваших дітей за межами домашнього середовища?",
12 =>
"Чи утримував кривдник вас та/або ваших дітей проти вашої волі в певному місці або будь-яким іншим чином обмежував свободу, у тому числі свободу в спілкуванні?",
13 =>
"Чи вплинула поведінка кривдника на безпеку вас та/або ваших дітей?",
14 =>
"Чи кривдник має алкогольну залежність або зловживає алкогольними напоями?",
15 =>
"Чи кривдник має наркотичну залежність або зловживає наркотичними речовинами?",
16 =>
"Чи кривдник коли-небудь погрожував вбити, вбив або завдавав навмисно шкоди домашній та/або іншій тварині?",
17 =>
"Чи кривдник вчиняв щодо вас та/або ваших дітей, коли ви була вагітна або з новонародженою дитиною / немовлям?",
18 =>
"Чи кривдник має фінансові проблеми?",
19 =>
"Чи є ви та/або ваші діти економічно залежною(ними) від кривдника?",
20 =>
"Чи були випадки після одруження або проживання разом, коли кривдник покидав на тривалий час (не менше ніж на 10 діб) сім'ю без причини та без надання пояснень?",
21 =>
"Чи є у вас дитина/діти від іншого шлюбу, про яких кривдник знає та/або нещодавно дізнався?",
22 =>
"Чи перебуває ваша сім'я під соціальним супроводом?",
23 =>
"Чи видавав суд кривднику обмежувальний припис?",
24 =>
"У разі видачі кривднику обмежувального припису, чи порушував він заходи тимчасового обмеження прав кривдника або покладення на нього обов'язків, передбачених таким приписом?",
25 =>
"Чи відомо вам про притягнення кривдника до кримінальної відповідальності за вбивство, спричинення тілесних ушкоджень, зґвалтування та/або інші злочини проти статевої свободи та статевої недоторканості особи? (якщо так, необхідне виділити або підкреслити)",
26 =>
"Чи кривдник виганяв вас та/або ваших дітей з місця проживання та/або погрожував здійснити такі дії?",
27 =>
"Чи є щось додаткове, що змушує вас турбуватися про вашу безпеку?",
];
$limit = count($quizData);
?>
